InformationRegisters/ИсторияЗвонковАТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗвонковАТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пропущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разговор</Name>
					<Comment>Длительность разговора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ожидание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоматическиеДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗаписиСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_НомерТолькоЦифры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФормат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принят</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДЗаписиЧислом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеЗвонка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДВАТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НаправлениеЗвонка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НаправлениеЗвонка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыСозданияЛида.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыСозданияЛида</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПриВходящемЗвонке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПриРазбореИсторииАТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПриРазбореЭлектронныхЯщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПоДаннымРойстат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическиПоДаннымБитрикс24</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзExcel</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЖурналЗвонков/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСостояние();
	
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИсторияЗвонковАТС.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ИсторияЗвонковАТС КАК ИсторияЗвонковАТС
	|";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();	
	Пока Выборка.Следующий() Цикл
		Элементы.ИсторияОтборПоСтатусу.СписокВыбора.Добавить(Выборка.Статус);
	КонецЦикла;
	
	//#16249
	//ДатаЗапросаИстории = Константы.ТелефонияДатаПоследнегоПолученияИсторииИзАТС.Получить();
	ИнтервалЗапросаИсторииЗвонков = Константы.ИнтервалЗапросаИсторииЗвонков.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ИнтервалЗапросаИсторииЗвонков > 1 Тогда
		ПодключитьОбработчикОжидания("ПроверитьОбновлениеИсторииОбработчикОжидания", ИнтервалЗапросаИсторииЗвонков, Ложь);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗагруженаИсторияАТС" Тогда
		Элементы.ИсторияЗвонковАТС.Обновить();
		ОбновитьСостояние();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПроверитьОбновлениеИсторииОбработчикОжидания()
	
	Если ПроверитьОбновлениеИсторииСервер() Тогда
		Элементы.ИсторияЗвонковАТС.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьОбновлениеИсторииСервер()
	
	ДатаЗапросаИстории = Константы.ТелефонияДатаПоследнегоПолученияИсторииИзАТС.Получить();
	Если НЕ ДатаЗапросаИстории = ИсторияАТС_ДатаПоследнегоПолучения Тогда
		ОбновитьСостояние();
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОбновитьСостояние()
	
	ИсторияАТС_ДатаПоследнегоПолучения = Константы.ТелефонияДатаПоследнегоПолученияИсторииИзАТС.Получить();
	Если ТекущаяДатаСеанса() - ИсторияАТС_ДатаПоследнегоПолучения > 86400 Тогда
		Элементы.ИсторияАТС_ДатаПоследнегоПолучения.ЦветТекста = WebЦвета.Красный;
		Элементы.ИсторияАТС_ДатаПоследнегоПолучения.Шрифт = Новый Шрифт(Элементы.ИсторияАТС_ДатаПоследнегоПолучения.Шрифт,,,Истина);
	Иначе
		Элементы.ИсторияАТС_ДатаПоследнегоПолучения.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		Элементы.ИсторияАТС_ДатаПоследнегоПолучения.Шрифт = Новый Шрифт(Элементы.ИсторияАТС_ДатаПоследнегоПолучения.Шрифт,,,Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановкаФильтраИсторияЗвонковАТС()
	
	ИсторияЗвонковАТС.Отбор.Элементы.Очистить();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗвонковАТС, "НомерФормат", 		ИсторияОтборПоНомеру,    		ВидСравненияКомпоновкиДанных.Равно, , НЕ ПустаяСтрока(ИсторияОтборПоНомеру));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗвонковАТС, "ДатаС", 			НачалоДня(ИсторияДатаНачала),  	ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , ЗначениеЗаполнено(ИсторияДатаНачала));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗвонковАТС, "Дата", 				КонецДня(ИсторияДатаОкончания), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, , ЗначениеЗаполнено(ИсторияДатаОкончания));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗвонковАТС, "ВнутреннийНомер", 	ИсторияОтборПоВнНомеру,			ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ИсторияОтборПоВнНомеру));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗвонковАТС, "Статус", 			ИсторияОтборПоСтатусу,			ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ИсторияОтборПоСтатусу));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗвонковАТС, "Направление", 		ИсторияОтборПоНаправлению,		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ИсторияОтборПоНаправлению));

КонецПроцедуры

&НаКлиенте
Процедура ИсторияДатаНачалаПриИзменении(Элемент)
	УстановкаФильтраИсторияЗвонковАТС();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияДатаОкончанияПриИзменении(Элемент)
	УстановкаФильтраИсторияЗвонковАТС();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОтборПоНомеруПриИзменении(Элемент)
	ИсторияОтборПоНомеру = СофтФон.ПолучитьНомерТелефонаВМеждународномФорматеПользователя(ИсторияОтборПоНомеру);
	УстановкаФильтраИсторияЗвонковАТС();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОтборПоВнНомеруПриИзменении(Элемент)
	УстановкаФильтраИсторияЗвонковАТС();	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОтборПоСтатусуПриИзменении(Элемент)
	УстановкаФильтраИсторияЗвонковАТС();	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОтборПоНаправлениюПриИзменении(Элемент)
	УстановкаФильтраИсторияЗвонковАТС();	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьЗвонокОбработанным(Команда)
	
	ТекДанные = Элементы.ИсторияЗвонковАТС.ТекущиеДанные;	
	Если ТекДанные = Неопределено Тогда
		Сообщить("Не выделена строка истории");
		Возврат;
	КонецЕсли;
	Если ТекДанные.Обработан Тогда
		Сообщить("Строка истории уже обработана");
		Возврат;
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура("КлючРегистра", Элементы.ИсторияЗвонковАТС.ТекущаяСтрока);
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбработкиЗвонка", ЭтаФорма, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, "Отметить звонок как обработанный?", РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбработкиЗвонка(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ОтметитьЗвонокОбработаннымНаСервере(ДополнительныеПараметры.КлючРегистра);

КонецПроцедуры

&НаСервере
Процедура ОтметитьЗвонокОбработаннымНаСервере(КлючРегистра)
	МенеджерЗаписи = РегистрыСведений.ИсторияЗвонковАТС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючРегистра);
	МенеджерЗаписи.Прочитать(); 
	МенеджерЗаписи.Обработан = Истина;
	МенеджерЗаписи.Пользователь  = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.ДатаОбработки = ТекущаяДатаСеанса();
				
	МенеджерЗаписи.Записать(Истина);
	
	Элементы.ИсторияЗвонковАТС.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛидПоЗвонку(Команда)
	ТекДанные = Элементы.ИсторияЗвонковАТС.ТекущиеДанные;	
	Если ТекДанные = Неопределено Тогда
		Сообщить("Не выделена строка истории");
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекДанные.Лид) Тогда
		Сообщить("По выбранному звонку уже имеется созданный лид");
		Возврат;
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура("КлючРегистра", Элементы.ИсторияЗвонковАТС.ТекущаяСтрока);
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСозданияЛидаПоЗвонку", ЭтаФорма, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, "Создать лид по выбранному звонку?", РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаСозданияЛидаПоЗвонку(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ЛидСсылка = СоздатьЛидПоЗвонкуНаСервере(ДополнительныеПараметры.КлючРегистра);
	Если НЕ ЛидСсылка = Неопределено Тогда
		ПараметрыФормы = Новый Структура("Ключ", ЛидСсылка);
		ОткрытьФорму("Документ.Лид.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоздатьЛидПоЗвонкуНаСервере(КлючРегистра)
	
	//++ №7190 читаем из регистра запись сразу, чтобы обращаться к ресурсам и реквизитам
	МенеджерЗаписи = РегистрыСведений.ИсторияЗвонковАТС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючРегистра);
	МенеджерЗаписи.Прочитать();
	//-- №7190
	
	//++#6672
	РекламныйИсточник = Справочники.РекламныеИсточники.ПустаяСсылка();
	Если Не ПустаяСтрока(МенеджерЗаписи.ЛинияНомер) Тогда
		РекламныйИсточник = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточникПоНомеруТелефонаНаСервере(МенеджерЗаписи.ЛинияНомер);
	КонецЕсли;
	//--#6672
	
	ЗвонокОффлайн = Ложь;
	Если НЕ МенеджерЗаписи.Пропущен
		И МенеджерЗаписи.Направление = Перечисления.НаправлениеЗвонка.Входящий
		И ЗначениеЗаполнено(МенеджерЗаписи.ВнутреннийНомер)					 
		Тогда
		МассивВН = СофтФон.ВнутренниеНомераПринимающиеЗвонки();
		ЗвонокОффлайн = (НЕ МассивВН.Найти(МенеджерЗаписи.ВнутреннийНомер) = Неопределено);
	КонецЕсли;					
	
	ДанныеЗвонка = Новый Структура("ИДЗвонка, ИДСессииЗвонка, ИДВАТС, НомерКлиента, ВнешняяЛиния, Пропущен, НовыйЗвонок, ЗвонокОффлайн",
									МенеджерЗаписи.ИД, "", МенеджерЗаписи.ИДВАТС, МенеджерЗаписи.НомерФормат, МенеджерЗаписи.ЛинияНомер, МенеджерЗаписи.Пропущен, Ложь, ЗвонокОффлайн);
											
	РеквизитыНовогоЛида = Новый Структура("РекламныйИсточник, СпособСоздания, ДатаЗвонкаСоздавшегоЛид", 
										   РекламныйИсточник, Перечисления.СпособыСозданияЛида.АвтоматическиПриРазбореИсторииАТС, МенеджерЗаписи.Дата); //#8090
	ЛидСсылка = ОбщийМодуль.ПолучитьЛидВРаботе(ДанныеЗвонка, РеквизитыНовогоЛида, Истина);
	
	Если ЗначениеЗаполнено(ЛидСсылка) Тогда
		
		//++ №7190 комментируем, т.к. выше сразу будет чтение записи
		//МенеджерЗаписи = РегистрыСведений.ИсторияЗвонковАТС.СоздатьМенеджерЗаписи();
		//ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючРегистра);
		//МенеджерЗаписи.Прочитать();
		//-- №7190
		МенеджерЗаписи.Лид 			 = ЛидСсылка;
		МенеджерЗаписи.Действие 	 = Справочники.АвтоматическиеДействия.СозданНовыйЛид;
		МенеджерЗаписи.Обработан 	 = Истина;
		МенеджерЗаписи.Пользователь  = Пользователи.ТекущийПользователь();
		МенеджерЗаписи.ДатаОбработки = ТекущаяДатаСеанса();	
		МенеджерЗаписи.Записать(Истина);
		
		Элементы.ИсторияЗвонковАТС.Обновить();

		Возврат ЛидСсылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПрослушатьЗаписьЗвонка(Команда)
	
	ТекДанные=Элементы.ИсторияЗвонковАТС.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	//СофтФонКлиент.ПрослушатьЗаписьЗвонка(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);  // 2021-12-22 Ильнур
	СофтФонКлиент.ОткрытьЗаписьЗвонкаПоСсылке(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьЗаписьЗвонка(Команда)
	
	ТекДанные=Элементы.ИсторияЗвонковАТС.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СофтФонКлиент.СкачатьЗаписьЗвонка(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаписьЗвонкаПоСсылке(Команда)
	
	ТекДанные=Элементы.ИсторияЗвонковАТС.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СофтФонКлиент.ОткрытьЗаписьЗвонкаПоСсылке(ТекДанные.ИДВАТС, ТекДанные.ИД, ТекДанные.ЕстьЗапись, ТекДанные.ФайлЗаписиСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИсториюИзАТСВручную(Команда)
	ОписаниеОповещенияПослеВыбораПериода = Новый ОписаниеОповещения("ПослеВыбораПериодаЗапросаИсторииИзАТС", ЭтаФорма);	
	ОткрытьФорму("Обработка.РабочееМестоМенеджераРозничныхПродаж.Форма.ФормаЗапросаИсторииИзАТС", , ЭтотОбъект,,,, ОписаниеОповещенияПослеВыбораПериода); 	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериодаЗапросаИсторииИзАТС(Результат, ДополительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		// отправляем на панель СофтФона
		Оповестить("ПолучитьИсториюИзАТСВручную", Результат);
		ПоказатьОповещениеПользователя("Запрос истории");
		ОбновитьСостояние();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсторияЗвонковАТСПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого ТекущаяСтрока Из Строки Цикл
		// для поля Контрагент отключено ИспользоватьВсегда
		Если НЕ ТекущаяСтрока.Значение.Данные.Свойство("Контрагент") Тогда
			Прервать;
		КонецЕсли;
		ТекущаяСтрока.Значение.Данные.Контрагент = ОбщийМодульВызовСервера.ПолучитьКонтрагентаПоНомеруТелефона(ТекущаяСтрока.Значение.Данные.Номер);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗвонковАТСПередУдалением(Элемент, Отказ)
	
	Если НЕ ДоступнаРольАдминистратора() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступнаРольАдминистратора()
	Возврат РольДоступна("АдминистраторСистемы");
КонецФункции
